<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current release of Vernier's Graphical Analysis.</string>
    <key>Identifier</key>
    <string>com.github.wardsparadox.download.autodesk.sketchbook</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>SketchBook</string>
      <key>CHECK_PAGE_URL</key>
      <string>http://update.sketchbook.com/sbp_desktop_update.xml</string>
      <key>CHECK_PAGE_PATTERN</key>
        <string>(https.*\/mac\/Sketch.*?.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
      <dict>
      	<key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%CHECK_PAGE_URL%</string>
          <key>re_pattern</key>
          <string>%CHECK_PAGE_PATTERN%</string>
          <key>re_flags</key>
          <array>
            <string>IGNORECASE</string>
          </array>
        </dict>
      </dict>
      <dict>
         <key>Processor</key>
         <string>URLDownloader</string>
         <key>Arguments</key>
         <dict>
            <key>filename</key>
            <string>%NAME%.dmg</string>
            <key>url</key>
            <string>%match%</string>
         </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>FlatPkgUnpacker</string>
        <key>Arguments</key>
        <dict>
        <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/pkgroot</string>
          <key>flat_pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/*.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>FileFinder</string>
        <key>Arguments</key>
        <dict>
           <key>pattern</key>
           <string>%RECIPE_CACHE_DIR%/pkgroot/*.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>FlatPkgPacker</string>
        <key>Arguments</key>
        <dict>
        <key>destination_pkg</key>
          <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
          <key>source_flatpkg_dir</key>
          <string>%found_filename%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <!-- TODO: Add Code Signature Validation, might be Munki Only
      <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
          <key>input_path</key>
          <string>%pathname%/Vernier*.*app</string>
          <key>requirement</key>
          <string>identifier "com.autodesk.SketchBook" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XXKJ396S2Y</string>
        </dict>
      </dict> -->
    </array>
  </dict>
</plist>
